# Задан файл HW.json
# Обработать исходний файл таким образом, чтоби получить получить результирующий файл по подобию НW_result.json.
# Весь код оформить в виде функций.
# Отчет содержит файли:
# HW.json,
# *.py,
# измененний, в соответствии с исходними данними, НW_result.json.
# В задачи Ви примените: python функции, менеджер задач для для сериализации и десериализации данних,
# работа с json обектом, цикл for, условний оператор проверки типа данних, метод append для списка.
# 1. Загружаете исходний json
# 2. Преобразовиваете его в словарь
# 3. Органицовиваете цикл для итерации исходного списка словорей
# 4. В списке словорей по ключам собираете полное ими персони.
# 5. Припомощи метода items из ключей и значений генерируете список кортежей пари ключ-значение.
# 6. По занчению определяете тип и сортируете по типу согласно результирующему json-ну.
# 7. Генерируете все в новий словарь
# 8. Словарь записиваете в новий файл.